## Part 1. Compairing the number of covid confirmed cases across 5 continents

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
covid_confirmed_cases = pd.read_csv("total-cases-covid-19.csv")
covid_confirmed_cases

,Entity,Code,Date,Total confirmed cases,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Afghanistan,AFG,25-Feb-20,1,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,26-Feb-20,1,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,27-Feb-20,1,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,AFG,28-Feb-20,1,NaN,NaN,NaN,NaN,NaN
4,Afghanistan,AFG,29-Feb-20,1,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
12282,Zimbabwe,ZWE,25-Apr-20,29,NaN,NaN,NaN,NaN,NaN
12283,Zimbabwe,ZWE,26-Apr-20,31,NaN,NaN,NaN,NaN,NaN
12284,Zimbabwe,ZWE,27-Apr-20,31,NaN,NaN,NaN,NaN,NaN
12285,Zimbabwe,ZWE,28-Apr-20,32,NaN,NaN,NaN,NaN,NaN
12286,Zimbabwe,ZWE,29-Apr-20,32,NaN,NaN,NaN,NaN,NaN

### Change column name "Total confirmed cases" to "Total_confirmed_cases"

In [3]:
covid_confirmed_cases = covid_confirmed_cases.rename(columns = {'Total confirmed cases ': 'Total_confirmed_cases'})
covid_confirmed_cases.head()

,Entity,Code,Date,Total_confirmed_cases,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Afghanistan,AFG,25-Feb-20,1,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,26-Feb-20,1,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,27-Feb-20,1,NaN,NaN,NaN,NaN,NaN
3,Afghanistan,AFG,28-Feb-20,1,NaN,NaN,NaN,NaN,NaN
4,Afghanistan,AFG,29-Feb-20,1,NaN,NaN,NaN,NaN,NaN

### Remove unwanted columns

In [4]:
covid_confirmed_cases.columns

Index(['Entity', 'Code', 'Date', 'Total_confirmed_cases', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8'],
      dtype='object')

In [5]:
covid_confirmed_cases = covid_confirmed_cases[['Entity', 'Code', 'Date', 'Total_confirmed_cases']]
covid_confirmed_cases.head()

        Entity Code       Date  Total_confirmed_cases
0  Afghanistan  AFG  25-Feb-20                      1
1  Afghanistan  AFG  26-Feb-20                      1
2  Afghanistan  AFG  27-Feb-20                      1
3  Afghanistan  AFG  28-Feb-20                      1
4  Afghanistan  AFG  29-Feb-20                      1

### Create a separeate dataframe of confirmed cases of six continents

In [6]:
continents = ["Asia", "Europe", "North America", "South America", "Oceania", "Africa"]
covid_continents= pd.DataFrame()

for continent in continents:
    covid_continents = covid_continents.append(covid_confirmed_cases.loc[covid_confirmed_cases.Entity == continent])

covid_continents

     Entity Code       Date  Total_confirmed_cases
545    Asia  NaN  31-Dec-19                     27
546    Asia  NaN   1-Jan-20                     27
547    Asia  NaN   2-Jan-20                     27
548    Asia  NaN   3-Jan-20                     44
549    Asia  NaN   4-Jan-20                     44
..      ...  ...        ...                    ...
125  Africa  NaN  25-Apr-20                  29075
126  Africa  NaN  26-Apr-20                  30316
127  Africa  NaN  27-Apr-20                  31748
128  Africa  NaN  28-Apr-20                  33164
129  Africa  NaN  29-Apr-20                  34934

[552 rows x 4 columns]

- display a plot with 5 legends(continents) showing Date vs. Total_confirmed_cases  
- claculate the log (rate of increase) for each line

## Part 2. Comparing across top 3 continents with the highest total confirmed cases

### Remove rows whose Code is NaN (non countries)

In [7]:
covid_confirmed_cases.Code.unique()

array(['AFG', nan, 'ALB', 'DZA', 'AND', 'AGO', 'AIA', 'ATG', 'ARG', 'ARM',
       'ABW', 'AUS', 'AUT', 'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR',
       'BEL', 'BLZ', 'BEN', 'BMU', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA',
       'VGB', 'BRN', 'BGR', 'BFA', 'BDI', 'KHM', 'CMR', 'CAN', 'CPV',
       'CYM', 'CAF', 'TCD', 'CHL', 'CHN', 'COL', 'COG', 'CRI', 'CIV',
       'HRV', 'CUB', 'CUW', 'CYP', 'CZE', 'COD', 'DNK', 'DJI', 'DMA',
       'DOM', 'ECU', 'EGY', 'SLV', 'GNQ', 'ERI', 'EST', 'ETH', 'FRO',
       'FLK', 'FJI', 'FIN', 'FRA', 'PYF', 'GAB', 'GMB', 'GEO', 'DEU',
       'GHA', 'GIB', 'GRC', 'GRL', 'GRD', 'GUM', 'GTM', 'GGY', 'GIN',
       'GNB', 'GUY', 'HTI', 'HND', 'HUN', 'ISL', 'IND', 'IDN', 'IRN',
       'IRQ', 'IRL', 'IMN', 'ISR', 'ITA', 'JAM', 'JPN', 'JEY', 'JOR',
       'KAZ', 'KEN', 'OWID_KOS', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN', 'LBR',
       'LBY', 'LIE', 'LTU', 'LUX', 'MKD', 'MDG', 'MWI', 'MYS', 'MDV',
       'MLI', 'MLT', 'MRT', 'MUS', 'MEX', 'MDA', 'MCO', 'MNG', 'MNE',
       'MSR', 'MAR', 'MOZ', 'MMR', 'NAM', 'NPL', 'NLD', 'NCL', 'NZL',
       'NIC', 'NER', 'NGA', 'MNP', 'NOR', 'OMN', 'PAK', 'PSE', 'PAN',
       'PNG', 'PRY', 'PER', 'PHL', 'POL', 'PRT', 'PRI', 'QAT', 'ROU',
       'RUS', 'RWA', 'KNA', 'LCA', 'VCT', 'SMR', 'STP', 'SAU', 'SEN',
       'SRB', 'SYC', 'SLE', 'SGP', 'SVK', 'SVN', 'SOM', 'ZAF', 'KOR',
       'SSD', 'ESP', 'LKA', 'SDN', 'SUR', 'SWZ', 'SWE', 'CHE', 'SYR',
       'TWN', 'TZA', 'THA', 'TGO', 'TTO', 'TUN', 'TUR', 'TCA', 'UGA',
       'UKR', 'ARE', 'GBR', 'USA', 'VIR', 'URY', 'UZB', 'VEN', 'VNM',
       'OWID_WRL', 'YEM', 'ZMB', 'ZWE'], dtype=object)

In [8]:
bool_crit = (pd.isnull(covid_confirmed_cases.Code))
print("Number of NaN entries identified: ", sum(bool_crit))
covid_confirmed_cases[bool_crit]

Number of NaN entries identified:  1528

,Entity,Code,Date,Total_confirmed_cases
55,Africa,NaN,15-Feb-20,1
56,Africa,NaN,16-Feb-20,1
57,Africa,NaN,17-Feb-20,1
58,Africa,NaN,18-Feb-20,1
59,Africa,NaN,19-Feb-20,1
...,...,...,...,...
12180,"World excl. China, South Korea, Japan and Sing...",NaN,25-Apr-20,2612056
12181,"World excl. China, South Korea, Japan and Sing...",NaN,26-Apr-20,2711959
12182,"World excl. China, South Korea, Japan and Sing...",NaN,27-Apr-20,2794347
12183,"World excl. China, South Korea, Japan and Sing...",NaN,28-Apr-20,2858738
12184,"World excl. China, South Korea, Japan and Sing...",NaN,29-Apr-20,2928866

In [9]:
covid_confirmed_cases_countries = covid_confirmed_cases[~bool_crit]
covid_confirmed_cases_countries

            Entity Code       Date  Total_confirmed_cases
0      Afghanistan  AFG  25-Feb-20                      1
1      Afghanistan  AFG  26-Feb-20                      1
2      Afghanistan  AFG  27-Feb-20                      1
3      Afghanistan  AFG  28-Feb-20                      1
4      Afghanistan  AFG  29-Feb-20                      1
...            ...  ...        ...                    ...
12282     Zimbabwe  ZWE  25-Apr-20                     29
12283     Zimbabwe  ZWE  26-Apr-20                     31
12284     Zimbabwe  ZWE  27-Apr-20                     31
12285     Zimbabwe  ZWE  28-Apr-20                     32
12286     Zimbabwe  ZWE  29-Apr-20                     32

[10759 rows x 4 columns]

### Select data entries on 29-Apr-20

In [10]:
countries_0429 = covid_confirmed_cases_countries.loc[covid_confirmed_cases_countries.Date == "29-Apr-20"]
countries_0429

            Entity      Code       Date  Total_confirmed_cases
54     Afghanistan       AFG  29-Apr-20                   1827
181        Albania       ALB  29-Apr-20                    750
240        Algeria       DZA  29-Apr-20                   3649
287        Andorra       AND  29-Apr-20                    748
326         Angola       AGO  29-Apr-20                     27
...            ...       ...        ...                    ...
11739      Vietnam       VNM  29-Apr-20                    270
11860        World  OWID_WRL  29-Apr-20                3052370
12204        Yemen       YEM  29-Apr-20                      1
12246       Zambia       ZMB  29-Apr-20                     95
12286     Zimbabwe       ZWE  29-Apr-20                     32

[201 rows x 4 columns]

### Create a dictionary of all countries in the world

In [11]:
pip install pycountry-convert

Requirement already satisfied: pycountry-convert in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (0.7.2)
Requirement already satisfied: pytest-cov>=2.5.1 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (2.8.1)
Requirement already satisfied: repoze.lru>=0.7 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (0.7)
Requirement already satisfied: wheel>=0.30.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (0.33.6)
Requirement already satisfied: pytest-mock>=1.6.3 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (3.1.0)
Requirement already satisfied: pprintpp>=0.3.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (0.4.0)
Requirement already satisfied: pytest>=3.4.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (5.2.1)
Requirement already satisfied: pycountry>=16.11.27.1 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pycountry-convert) (19.8.18)
Requirement already satisfied: coverage>=4.4 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest-cov>=2.5.1->pycountry-convert) (5.1)
Requirement already satisfied: py>=1.5.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (1.8.0)
Requirement already satisfied: packaging in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (19.2)
Requirement already satisfied: attrs>=17.4.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (19.2.0)
Requirement already satisfied: more-itertools>=4.0.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (7.2.0)
Requirement already satisfied: atomicwrites>=1.0 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (1.3.0)
Requirement already satisfied: pluggy<1.0,>=0.12 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (0.13.0)
Requirement already satisfied: wcwidth in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (0.1.7)
Requirement already satisfied: importlib-metadata>=0.12 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from pytest>=3.4.0->pycountry-convert) (0.23)
Requirement already satisfied: pyparsing>=2.0.2 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from packaging->pytest>=3.4.0->pycountry-convert) (2.4.2)
Requirement already satisfied: six in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from packaging->pytest>=3.4.0->pycountry-convert) (1.12.0)
Requirement already satisfied: zipp>=0.5 in /Users/irene/opt/anaconda3/lib/python3.7/site-packages (from importlib-metadata>=0.12->pytest>=3.4.0->pycountry-convert) (0.6.0)
Note: you may need to restart the kernel to use updated packages.

In [12]:

import pycountry
countries = list(pycountry.countries)
countries_alpha2 = []
countries_alpha3 = []

for i in range(len(countries)):
    countries_alpha2.append(countries[i].alpha_2)
    countries_alpha3.append(countries[i].alpha_3)

countries_alpha3
countries_alpha2
countries

[Country(alpha_2='AW', alpha_3='ABW', name='Aruba', numeric='533'),
 Country(alpha_2='AF', alpha_3='AFG', name='Afghanistan', numeric='004', official_name='Islamic Republic of Afghanistan'),
 Country(alpha_2='AO', alpha_3='AGO', name='Angola', numeric='024', official_name='Republic of Angola'),
 Country(alpha_2='AI', alpha_3='AIA', name='Anguilla', numeric='660'),
 Country(alpha_2='AX', alpha_3='ALA', name='Åland Islands', numeric='248'),
 Country(alpha_2='AL', alpha_3='ALB', name='Albania', numeric='008', official_name='Republic of Albania'),
 Country(alpha_2='AD', alpha_3='AND', name='Andorra', numeric='020', official_name='Principality of Andorra'),
 Country(alpha_2='AE', alpha_3='ARE', name='United Arab Emirates', numeric='784'),
 Country(alpha_2='AR', alpha_3='ARG', name='Argentina', numeric='032', official_name='Argentine Republic'),
 Country(alpha_2='AM', alpha_3='ARM', name='Armenia', numeric='051', official_name='Republic of Armenia'),
 Country(alpha_2='AS', alpha_3='ASM', name='American Samoa', numeric='016'),
 Country(alpha_2='AQ', alpha_3='ATA', name='Antarctica', numeric='010'),
 Country(alpha_2='TF', alpha_3='ATF', name='French Southern Territories', numeric='260'),
 Country(alpha_2='AG', alpha_3='ATG', name='Antigua and Barbuda', numeric='028'),
 Country(alpha_2='AU', alpha_3='AUS', name='Australia', numeric='036'),
 Country(alpha_2='AT', alpha_3='AUT', name='Austria', numeric='040', official_name='Republic of Austria'),
 Country(alpha_2='AZ', alpha_3='AZE', name='Azerbaijan', numeric='031', official_name='Republic of Azerbaijan'),
 Country(alpha_2='BI', alpha_3='BDI', name='Burundi', numeric='108', official_name='Republic of Burundi'),
 Country(alpha_2='BE', alpha_3='BEL', name='Belgium', numeric='056', official_name='Kingdom of Belgium'),
 Country(alpha_2='BJ', alpha_3='BEN', name='Benin', numeric='204', official_name='Republic of Benin'),
 Country(alpha_2='BQ', alpha_3='BES', name='Bonaire, Sint Eustatius and Saba', numeric='535', official_name='Bonaire, Sint Eustatius and Saba'),
 Country(alpha_2='BF', alpha_3='BFA', name='Burkina Faso', numeric='854'),
 Country(alpha_2='BD', alpha_3='BGD', name='Bangladesh', numeric='050', official_name="People's Republic of Bangladesh"),
 Country(alpha_2='BG', alpha_3='BGR', name='Bulgaria', numeric='100', official_name='Republic of Bulgaria'),
 Country(alpha_2='BH', alpha_3='BHR', name='Bahrain', numeric='048', official_name='Kingdom of Bahrain'),
 Country(alpha_2='BS', alpha_3='BHS', name='Bahamas', numeric='044', official_name='Commonwealth of the Bahamas'),
 Country(alpha_2='BA', alpha_3='BIH', name='Bosnia and Herzegovina', numeric='070', official_name='Republic of Bosnia and Herzegovina'),
 Country(alpha_2='BL', alpha_3='BLM', name='Saint Barthélemy', numeric='652'),
 Country(alpha_2='BY', alpha_3='BLR', name='Belarus', numeric='112', official_name='Republic of Belarus'),
 Country(alpha_2='BZ', alpha_3='BLZ', name='Belize', numeric='084'),
 Country(alpha_2='BM', alpha_3='BMU', name='Bermuda', numeric='060'),
 Country(alpha_2='BO', alpha_3='BOL', common_name='Bolivia', name='Bolivia, Plurinational State of', numeric='068', official_name='Plurinational State of Bolivia'),
 Country(alpha_2='BR', alpha_3='BRA', name='Brazil', numeric='076', official_name='Federative Republic of Brazil'),
 Country(alpha_2='BB', alpha_3='BRB', name='Barbados', numeric='052'),
 Country(alpha_2='BN', alpha_3='BRN', name='Brunei Darussalam', numeric='096'),
 Country(alpha_2='BT', alpha_3='BTN', name='Bhutan', numeric='064', official_name='Kingdom of Bhutan'),
 Country(alpha_2='BV', alpha_3='BVT', name='Bouvet Island', numeric='074'),
 Country(alpha_2='BW', alpha_3='BWA', name='Botswana', numeric='072', official_name='Republic of Botswana'),
 Country(alpha_2='CF', alpha_3='CAF', name='Central African Republic', numeric='140'),
 Country(alpha_2='CA', alpha_3='CAN', name='Canada', numeric='124'),
 Country(alpha_2='CC', alpha_3='CCK', name='Cocos (Keeling) Islands', numeric='166'),
 Country(alpha_2='CH', alpha_3='CHE', name='Switzerland', numeric='756', official_name='Swiss Confederation'),
 Country(alpha_2='CL', alpha_3='CHL', name='Chile', numeric='152', official_name='Republic of Chile'),
 Country(alpha_2='CN', alpha_3='CHN', name='China', numeric='156', official_name="People's Republic of China"),
 Country(alpha_2='CI', alpha_3='CIV', name="Côte d'Ivoire", numeric='384', official_name="Republic of Côte d'Ivoire"),
 Country(alpha_2='CM', alpha_3='CMR', name='Cameroon', numeric='120', official_name='Republic of Cameroon'),
 Country(alpha_2='CD', alpha_3='COD', name='Congo, The Democratic Republic of the', numeric='180'),
 Country(alpha_2='CG', alpha_3='COG', name='Congo', numeric='178', official_name='Republic of the Congo'),
 Country(alpha_2='CK', alpha_3='COK', name='Cook Islands', numeric='184'),
 Country(alpha_2='CO', alpha_3='COL', name='Colombia', numeric='170', official_name='Republic of Colombia'),
 Country(alpha_2='KM', alpha_3='COM', name='Comoros', numeric='174', official_name='Union of the Comoros'),
 Country(alpha_2='CV', alpha_3='CPV', name='Cabo Verde', numeric='132', official_name='Republic of Cabo Verde'),
 Country(alpha_2='CR', alpha_3='CRI', name='Costa Rica', numeric='188', official_name='Republic of Costa Rica'),
 Country(alpha_2='CU', alpha_3='CUB', name='Cuba', numeric='192', official_name='Republic of Cuba'),
 Country(alpha_2='CW', alpha_3='CUW', name='Curaçao', numeric='531', official_name='Curaçao'),
 Country(alpha_2='CX', alpha_3='CXR', name='Christmas Island', numeric='162'),
 Country(alpha_2='KY', alpha_3='CYM', name='Cayman Islands', numeric='136'),
 Country(alpha_2='CY', alpha_3='CYP', name='Cyprus', numeric='196', official_name='Republic of Cyprus'),
 Country(alpha_2='CZ', alpha_3='CZE', name='Czechia', numeric='203', official_name='Czech Republic'),
 Country(alpha_2='DE', alpha_3='DEU', name='Germany', numeric='276', official_name='Federal Republic of Germany'),
 Country(alpha_2='DJ', alpha_3='DJI', name='Djibouti', numeric='262', official_name='Republic of Djibouti'),
 Country(alpha_2='DM', alpha_3='DMA', name='Dominica', numeric='212', official_name='Commonwealth of Dominica'),
 Country(alpha_2='DK', alpha_3='DNK', name='Denmark', numeric='208', official_name='Kingdom of Denmark'),
 Country(alpha_2='DO', alpha_3='DOM', name='Dominican Republic', numeric='214'),
 Country(alpha_2='DZ', alpha_3='DZA', name='Algeria', numeric='012', official_name="People's Democratic Republic of Algeria"),
 Country(alpha_2='EC', alpha_3='ECU', name='Ecuador', numeric='218', official_name='Republic of Ecuador'),
 Country(alpha_2='EG', alpha_3='EGY', name='Egypt', numeric='818', official_name='Arab Republic of Egypt'),
 Country(alpha_2='ER', alpha_3='ERI', name='Eritrea', numeric='232', official_name='the State of Eritrea'),
 Country(alpha_2='EH', alpha_3='ESH', name='Western Sahara', numeric='732'),
 Country(alpha_2='ES', alpha_3='ESP', name='Spain', numeric='724', official_name='Kingdom of Spain'),
 Country(alpha_2='EE', alpha_3='EST', name='Estonia', numeric='233', official_name='Republic of Estonia'),
 Country(alpha_2='ET', alpha_3='ETH', name='Ethiopia', numeric='231', official_name='Federal Democratic Republic of Ethiopia'),
 Country(alpha_2='FI', alpha_3='FIN', name='Finland', numeric='246', official_name='Republic of Finland'),
 Country(alpha_2='FJ', alpha_3='FJI', name='Fiji', numeric='242', official_name='Republic of Fiji'),
 Country(alpha_2='FK', alpha_3='FLK', name='Falkland Islands (Malvinas)', numeric='238'),
 Country(alpha_2='FR', alpha_3='FRA', name='France', numeric='250', official_name='French Republic'),
 Country(alpha_2='FO', alpha_3='FRO', name='Faroe Islands', numeric='234'),
 Country(alpha_2='FM', alpha_3='FSM', name='Micronesia, Federated States of', numeric='583', official_name='Federated States of Micronesia'),
 Country(alpha_2='GA', alpha_3='GAB', name='Gabon', numeric='266', official_name='Gabonese Republic'),
 Country(alpha_2='GB', alpha_3='GBR', name='United Kingdom', numeric='826', official_name='United Kingdom of Great Britain and Northern Ireland'),
 Country(alpha_2='GE', alpha_3='GEO', name='Georgia', numeric='268'),
 Country(alpha_2='GG', alpha_3='GGY', name='Guernsey', numeric='831'),
 Country(alpha_2='GH', alpha_3='GHA', name='Ghana', numeric='288', official_name='Republic of Ghana'),
 Country(alpha_2='GI', alpha_3='GIB', name='Gibraltar', numeric='292'),
 Country(alpha_2='GN', alpha_3='GIN', name='Guinea', numeric='324', official_name='Republic of Guinea'),
 Country(alpha_2='GP', alpha_3='GLP', name='Guadeloupe', numeric='312'),
 Country(alpha_2='GM', alpha_3='GMB', name='Gambia', numeric='270', official_name='Republic of the Gambia'),
 Country(alpha_2='GW', alpha_3='GNB', name='Guinea-Bissau', numeric='624', official_name='Republic of Guinea-Bissau'),
 Country(alpha_2='GQ', alpha_3='GNQ', name='Equatorial Guinea', numeric='226', official_name='Republic of Equatorial Guinea'),
 Country(alpha_2='GR', alpha_3='GRC', name='Greece', numeric='300', official_name='Hellenic Republic'),
 Country(alpha_2='GD', alpha_3='GRD', name='Grenada', numeric='308'),
 Country(alpha_2='GL', alpha_3='GRL', name='Greenland', numeric='304'),
 Country(alpha_2='GT', alpha_3='GTM', name='Guatemala', numeric='320', official_name='Republic of Guatemala'),
 Country(alpha_2='GF', alpha_3='GUF', name='French Guiana', numeric='254'),
 Country(alpha_2='GU', alpha_3='GUM', name='Guam', numeric='316'),
 Country(alpha_2='GY', alpha_3='GUY', name='Guyana', numeric='328', official_name='Republic of Guyana'),
 Country(alpha_2='HK', alpha_3='HKG', name='Hong Kong', numeric='344', official_name='Hong Kong Special Administrative Region of China'),
 Country(alpha_2='HM', alpha_3='HMD', name='Heard Island and McDonald Islands', numeric='334'),
 Country(alpha_2='HN', alpha_3='HND', name='Honduras', numeric='340', official_name='Republic of Honduras'),
 Country(alpha_2='HR', alpha_3='HRV', name='Croatia', numeric='191', official_name='Republic of Croatia'),
 Country(alpha_2='HT', alpha_3='HTI', name='Haiti', numeric='332', official_name='Republic of Haiti'),
 Country(alpha_2='HU', alpha_3='HUN', name='Hungary', numeric='348', official_name='Hungary'),
 Country(alpha_2='ID', alpha_3='IDN', name='Indonesia', numeric='360', official_name='Republic of Indonesia'),
 Country(alpha_2='IM', alpha_3='IMN', name='Isle of Man', numeric='833'),
 Country(alpha_2='IN', alpha_3='IND', name='India', numeric='356', official_name='Republic of India'),
 Country(alpha_2='IO', alpha_3='IOT', name='British Indian Ocean Territory', numeric='086'),
 Country(alpha_2='IE', alpha_3='IRL', name='Ireland', numeric='372'),
 Country(alpha_2='IR', alpha_3='IRN', name='Iran, Islamic Republic of', numeric='364', official_name='Islamic Republic of Iran'),
 Country(alpha_2='IQ', alpha_3='IRQ', name='Iraq', numeric='368', official_name='Republic of Iraq'),
 Country(alpha_2='IS', alpha_3='ISL', name='Iceland', numeric='352', official_name='Republic of Iceland'),
 Country(alpha_2='IL', alpha_3='ISR', name='Israel', numeric='376', official_name='State of Israel'),
 Country(alpha_2='IT', alpha_3='ITA', name='Italy', numeric='380', official_name='Italian Republic'),
 Country(alpha_2='JM', alpha_3='JAM', name='Jamaica', numeric='388'),
 Country(alpha_2='JE', alpha_3='JEY', name='Jersey', numeric='832'),
 Country(alpha_2='JO', alpha_3='JOR', name='Jordan', numeric='400', official_name='Hashemite Kingdom of Jordan'),
 Country(alpha_2='JP', alpha_3='JPN', name='Japan', numeric='392'),
 Country(alpha_2='KZ', alpha_3='KAZ', name='Kazakhstan', numeric='398', official_name='Republic of Kazakhstan'),
 Country(alpha_2='KE', alpha_3='KEN', name='Kenya', numeric='404', official_name='Republic of Kenya'),
 Country(alpha_2='KG', alpha_3='KGZ', name='Kyrgyzstan', numeric='417', official_name='Kyrgyz Republic'),
 Country(alpha_2='KH', alpha_3='KHM', name='Cambodia', numeric='116', official_name='Kingdom of Cambodia'),
 Country(alpha_2='KI', alpha_3='KIR', name='Kiribati', numeric='296', official_name='Republic of Kiribati'),
 Country(alpha_2='KN', alpha_3='KNA', name='Saint Kitts and Nevis', numeric='659'),
 Country(alpha_2='KR', alpha_3='KOR', name='Korea, Republic of', numeric='410'),
 Country(alpha_2='KW', alpha_3='KWT', name='Kuwait', numeric='414', official_name='State of Kuwait'),
 Country(alpha_2='LA', alpha_3='LAO', name="Lao People's Democratic Republic", numeric='418'),
 Country(alpha_2='LB', alpha_3='LBN', name='Lebanon', numeric='422', official_name='Lebanese Republic'),
 Country(alpha_2='LR', alpha_3='LBR', name='Liberia', numeric='430', official_name='Republic of Liberia'),
 Country(alpha_2='LY', alpha_3='LBY', name='Libya', numeric='434', official_name='Libya'),
 Country(alpha_2='LC', alpha_3='LCA', name='Saint Lucia', numeric='662'),
 Country(alpha_2='LI', alpha_3='LIE', name='Liechtenstein', numeric='438', official_name='Principality of Liechtenstein'),
 Country(alpha_2='LK', alpha_3='LKA', name='Sri Lanka', numeric='144', official_name='Democratic Socialist Republic of Sri Lanka'),
 Country(alpha_2='LS', alpha_3='LSO', name='Lesotho', numeric='426', official_name='Kingdom of Lesotho'),
 Country(alpha_2='LT', alpha_3='LTU', name='Lithuania', numeric='440', official_name='Republic of Lithuania'),
 Country(alpha_2='LU', alpha_3='LUX', name='Luxembourg', numeric='442', official_name='Grand Duchy of Luxembourg'),
 Country(alpha_2='LV', alpha_3='LVA', name='Latvia', numeric='428', official_name='Republic of Latvia'),
 Country(alpha_2='MO', alpha_3='MAC', name='Macao', numeric='446', official_name='Macao Special Administrative Region of China'),
 Country(alpha_2='MF', alpha_3='MAF', name='Saint Martin (French part)', numeric='663'),
 Country(alpha_2='MA', alpha_3='MAR', name='Morocco', numeric='504', official_name='Kingdom of Morocco'),
 Country(alpha_2='MC', alpha_3='MCO', name='Monaco', numeric='492', official_name='Principality of Monaco'),
 Country(alpha_2='MD', alpha_3='MDA', common_name='Moldova', name='Moldova, Republic of', numeric='498', official_name='Republic of Moldova'),
 Country(alpha_2='MG', alpha_3='MDG', name='Madagascar', numeric='450', official_name='Republic of Madagascar'),
 Country(alpha_2='MV', alpha_3='MDV', name='Maldives', numeric='462', official_name='Republic of Maldives'),
 Country(alpha_2='MX', alpha_3='MEX', name='Mexico', numeric='484', official_name='United Mexican States'),
 Country(alpha_2='MH', alpha_3='MHL', name='Marshall Islands', numeric='584', official_name='Republic of the Marshall Islands'),
 Country(alpha_2='MK', alpha_3='MKD', name='North Macedonia', numeric='807', official_name='Republic of North Macedonia'),
 Country(alpha_2='ML', alpha_3='MLI', name='Mali', numeric='466', official_name='Republic of Mali'),
 Country(alpha_2='MT', alpha_3='MLT', name='Malta', numeric='470', official_name='Republic of Malta'),
 Country(alpha_2='MM', alpha_3='MMR', name='Myanmar', numeric='104', official_name='Republic of Myanmar'),
 Country(alpha_2='ME', alpha_3='MNE', name='Montenegro', numeric='499', official_name='Montenegro'),
 Country(alpha_2='MN', alpha_3='MNG', name='Mongolia', numeric='496'),
 Country(alpha_2='MP', alpha_3='MNP', name='Northern Mariana Islands', numeric='580', official_name='Commonwealth of the Northern Mariana Islands'),
 Country(alpha_2='MZ', alpha_3='MOZ', name='Mozambique', numeric='508', official_name='Republic of Mozambique'),
 Country(alpha_2='MR', alpha_3='MRT', name='Mauritania', numeric='478', official_name='Islamic Republic of Mauritania'),
 Country(alpha_2='MS', alpha_3='MSR', name='Montserrat', numeric='500'),
 Country(alpha_2='MQ', alpha_3='MTQ', name='Martinique', numeric='474'),
 Country(alpha_2='MU', alpha_3='MUS', name='Mauritius', numeric='480', official_name='Republic of Mauritius'),
 Country(alpha_2='MW', alpha_3='MWI', name='Malawi', numeric='454', official_name='Republic of Malawi'),
 Country(alpha_2='MY', alpha_3='MYS', name='Malaysia', numeric='458'),
 Country(alpha_2='YT', alpha_3='MYT', name='Mayotte', numeric='175'),
 Country(alpha_2='NA', alpha_3='NAM', name='Namibia', numeric='516', official_name='Republic of Namibia'),
 Country(alpha_2='NC', alpha_3='NCL', name='New Caledonia', numeric='540'),
 Country(alpha_2='NE', alpha_3='NER', name='Niger', numeric='562', official_name='Republic of the Niger'),
 Country(alpha_2='NF', alpha_3='NFK', name='Norfolk Island', numeric='574'),
 Country(alpha_2='NG', alpha_3='NGA', name='Nigeria', numeric='566', official_name='Federal Republic of Nigeria'),
 Country(alpha_2='NI', alpha_3='NIC', name='Nicaragua', numeric='558', official_name='Republic of Nicaragua'),
 Country(alpha_2='NU', alpha_3='NIU', name='Niue', numeric='570', official_name='Niue'),
 Country(alpha_2='NL', alpha_3='NLD', name='Netherlands', numeric='528', official_name='Kingdom of the Netherlands'),
 Country(alpha_2='NO', alpha_3='NOR', name='Norway', numeric='578', official_name='Kingdom of Norway'),
 Country(alpha_2='NP', alpha_3='NPL', name='Nepal', numeric='524', official_name='Federal Democratic Republic of Nepal'),
 Country(alpha_2='NR', alpha_3='NRU', name='Nauru', numeric='520', official_name='Republic of Nauru'),
 Country(alpha_2='NZ', alpha_3='NZL', name='New Zealand', numeric='554'),
 Country(alpha_2='OM', alpha_3='OMN', name='Oman', numeric='512', official_name='Sultanate of Oman'),
 Country(alpha_2='PK', alpha_3='PAK', name='Pakistan', numeric='586', official_name='Islamic Republic of Pakistan'),
 Country(alpha_2='PA', alpha_3='PAN', name='Panama', numeric='591', official_name='Republic of Panama'),
 Country(alpha_2='PN', alpha_3='PCN', name='Pitcairn', numeric='612'),
 Country(alpha_2='PE', alpha_3='PER', name='Peru', numeric='604', official_name='Republic of Peru'),
 Country(alpha_2='PH', alpha_3='PHL', name='Philippines', numeric='608', official_name='Republic of the Philippines'),
 Country(alpha_2='PW', alpha_3='PLW', name='Palau', numeric='585', official_name='Republic of Palau'),
 Country(alpha_2='PG', alpha_3='PNG', name='Papua New Guinea', numeric='598', official_name='Independent State of Papua New Guinea'),
 Country(alpha_2='PL', alpha_3='POL', name='Poland', numeric='616', official_name='Republic of Poland'),
 Country(alpha_2='PR', alpha_3='PRI', name='Puerto Rico', numeric='630'),
 Country(alpha_2='KP', alpha_3='PRK', name="Korea, Democratic People's Republic of", numeric='408', official_name="Democratic People's Republic of Korea"),
 Country(alpha_2='PT', alpha_3='PRT', name='Portugal', numeric='620', official_name='Portuguese Republic'),
 Country(alpha_2='PY', alpha_3='PRY', name='Paraguay', numeric='600', official_name='Republic of Paraguay'),
 Country(alpha_2='PS', alpha_3='PSE', name='Palestine, State of', numeric='275', official_name='the State of Palestine'),
 Country(alpha_2='PF', alpha_3='PYF', name='French Polynesia', numeric='258'),
 Country(alpha_2='QA', alpha_3='QAT', name='Qatar', numeric='634', official_name='State of Qatar'),
 Country(alpha_2='RE', alpha_3='REU', name='Réunion', numeric='638'),
 Country(alpha_2='RO', alpha_3='ROU', name='Romania', numeric='642'),
 Country(alpha_2='RU', alpha_3='RUS', name='Russian Federation', numeric='643'),
 Country(alpha_2='RW', alpha_3='RWA', name='Rwanda', numeric='646', official_name='Rwandese Republic'),
 Country(alpha_2='SA', alpha_3='SAU', name='Saudi Arabia', numeric='682', official_name='Kingdom of Saudi Arabia'),
 Country(alpha_2='SD', alpha_3='SDN', name='Sudan', numeric='729', official_name='Republic of the Sudan'),
 Country(alpha_2='SN', alpha_3='SEN', name='Senegal', numeric='686', official_name='Republic of Senegal'),
 Country(alpha_2='SG', alpha_3='SGP', name='Singapore', numeric='702', official_name='Republic of Singapore'),
 Country(alpha_2='GS', alpha_3='SGS', name='South Georgia and the South Sandwich Islands', numeric='239'),
 Country(alpha_2='SH', alpha_3='SHN', name='Saint Helena, Ascension and Tristan da Cunha', numeric='654'),
 Country(alpha_2='SJ', alpha_3='SJM', name='Svalbard and Jan Mayen', numeric='744'),

### Convert country_alpha3 to continent code

In [13]:
from pycountry_convert import country_alpha2_to_continent_code, country_alpha3_to_country_alpha2
continents = []

for i in range(len(countries_0429.index)):
    country_alpha3 = countries_0429.Code.iloc[i]
    if country_alpha3 not in countries_alpha3:
        continents.append("invalid")
        print(country_alpha3)
    else:
        country_alpha2 = country_alpha3_to_country_alpha2(country_alpha3)
        continents.append(country_alpha2_to_continent_code(country_alpha2) )

continents

OWID_KOS
OWID_WRL

['AS',
 'EU',
 'AF',
 'EU',
 'AF',
 'NA',
 'NA',
 'SA',
 'AS',
 'NA',
 'OC',
 'EU',
 'AS',
 'NA',
 'AS',
 'AS',
 'NA',
 'EU',
 'EU',
 'NA',
 'AF',
 'NA',
 'AS',
 'SA',
 'EU',
 'AF',
 'SA',
 'NA',
 'AS',
 'EU',
 'AF',
 'AF',
 'AS',
 'AF',
 'NA',
 'AF',
 'NA',
 'AF',
 'AF',
 'SA',
 'AS',
 'SA',
 'AF',
 'NA',
 'AF',
 'EU',
 'NA',
 'NA',
 'AS',
 'EU',
 'AF',
 'EU',
 'AF',
 'NA',
 'NA',
 'SA',
 'AF',
 'NA',
 'AF',
 'AF',
 'EU',
 'AF',
 'EU',
 'SA',
 'OC',
 'EU',
 'EU',
 'OC',
 'AF',
 'AF',
 'AS',
 'EU',
 'AF',
 'EU',
 'EU',
 'NA',
 'NA',
 'OC',
 'NA',
 'EU',
 'AF',
 'AF',
 'SA',
 'NA',
 'NA',
 'EU',
 'EU',
 'AS',
 'AS',
 'AS',
 'AS',
 'EU',
 'EU',
 'AS',
 'EU',
 'NA',
 'AS',
 'EU',
 'AS',
 'AS',
 'AF',
 'invalid',
 'AS',
 'AS',
 'AS',
 'EU',
 'AS',
 'AF',
 'AF',
 'EU',
 'EU',
 'EU',
 'EU',
 'AF',
 'AF',
 'AS',
 'AS',
 'AF',
 'EU',
 'AF',
 'AF',
 'NA',
 'EU',
 'EU',
 'AS',
 'EU',
 'NA',
 'AF',
 'AF',
 'AS',
 'AF',
 'AS',
 'EU',
 'OC',
 'OC',
 'NA',
 'AF',
 'AF',
 'OC',
 'EU',
 'AS',
 'AS',
 'AS',
 'NA',
 'OC',
 'SA',
 'SA',
 'AS',
 'EU',
 'EU',
 'NA',
 'AS',
 'EU',
 'EU',
 'AF',
 'NA',
 'NA',
 'NA',
 'EU',
 'AF',
 'AS',
 'AF',
 'EU',
 'AF',
 'AF',
 'AS',
 'EU',
 'EU',
 'AF',
 'AF',
 'AS',
 'AF',
 'AS',
 'AF',
 'SA',
 'AF',
 'EU',
 'EU',
 'AS',
 'AS',
 'AF',
 'AS',
 'AF',
 'NA',
 'AF',
 'AS',
 'NA',
 'AF',
 'EU',
 'AS',
 'EU',
 'NA',
 'NA',
 'SA',
 'AS',
 'SA',
 'AS',
 'invalid',
 'AS',
 'AF',
 'AF']

### Add column Continent to the dataframe countries_0429

In [14]:
countries_0429 = countries_0429.copy()
countries_0429["Continent"] = continents

countries_0429

            Entity      Code       Date  Total_confirmed_cases Continent
54     Afghanistan       AFG  29-Apr-20                   1827        AS
181        Albania       ALB  29-Apr-20                    750        EU
240        Algeria       DZA  29-Apr-20                   3649        AF
287        Andorra       AND  29-Apr-20                    748        EU
326         Angola       AGO  29-Apr-20                     27        AF
...            ...       ...        ...                    ...       ...
11739      Vietnam       VNM  29-Apr-20                    270        AS
11860        World  OWID_WRL  29-Apr-20                3052370   invalid
12204        Yemen       YEM  29-Apr-20                      1        AS
12246       Zambia       ZMB  29-Apr-20                     95        AF
12286     Zimbabwe       ZWE  29-Apr-20                     32        AF

[201 rows x 5 columns]

## Age Demographics - all countries

### Median Age by countries

In [15]:
median_age= pd.read_csv('median-age.csv')

In [16]:
median_age.rename(columns={'UN Population Division (Median Age) (2017) (years)':'median age'}, inplace=True)

In [17]:
median_age

           Entity Code  Year  median age
0     Afghanistan  AFG  1950   19.400000
1     Afghanistan  AFG  1955   19.200001
2     Afghanistan  AFG  1960   18.799999
3     Afghanistan  AFG  1965   18.400000
4     Afghanistan  AFG  1970   17.900000
...           ...  ...   ...         ...
7466     Zimbabwe  ZWE  2080   36.299999
7467     Zimbabwe  ZWE  2085   37.700001
7468     Zimbabwe  ZWE  2090   39.000000
7469     Zimbabwe  ZWE  2095   40.099998
7470     Zimbabwe  ZWE  2100   41.099998

[7471 rows x 4 columns]

In [18]:
#select rows that year = 2020
median_age_2020 = median_age[median_age['Year'] == 2020]

In [55]:
median_age_2020

              Entity Code  Year  median age
14       Afghanistan  AFG  2020   18.600000
45            Africa  NaN  2020   19.799999
76           Albania  ALB  2020   38.000000
107          Algeria  DZA  2020   29.100000
138           Angola  AGO  2020   16.799999
...              ...  ...   ...         ...
7299  Western Europe  NaN  2020   44.200001
7330  Western Sahara  ESH  2020   28.400000
7392           Yemen  YEM  2020   20.299999
7423          Zambia  ZMB  2020   17.700001
7454        Zimbabwe  ZWE  2020   19.600000

[237 rows x 4 columns]

#### drop rows that contain a particular string

In [20]:
median_age_2020.Code.unique()

array(['AFG', nan, 'ALB', 'DZA', 'AGO', 'ATG', 'ARG', 'ARM', 'ABW', 'AUS',
       'AUT', 'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR', 'BEL', 'BLZ',
       'BEN', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA', 'BRN', 'BGR', 'BFA',
       'BDI', 'KHM', 'CMR', 'CAN', 'CPV', 'CAF', 'TCD', 'OWID_CIS', 'CHL',
       'CHN', 'COL', 'COM', 'COG', 'CRI', 'CIV', 'HRV', 'CUB', 'CUW',
       'CYP', 'CZE', 'COD', 'DNK', 'DJI', 'DOM', 'ECU', 'EGY', 'SLV',
       'GNQ', 'ERI', 'EST', 'ETH', 'FJI', 'FIN', 'FRA', 'GUF', 'PYF',
       'GAB', 'GMB', 'GEO', 'DEU', 'GHA', 'GRC', 'GRD', 'GLP', 'GUM',
       'GTM', 'GIN', 'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'HUN', 'ISL',
       'IND', 'IDN', 'IRN', 'IRQ', 'IRL', 'ISR', 'ITA', 'JAM', 'JPN',
       'JOR', 'KAZ', 'KEN', 'KIR', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN',
       'LSO', 'LBR', 'LBY', 'LTU', 'LUX', 'MAC', 'MKD', 'MDG', 'MWI',
       'MYS', 'MDV', 'MLI', 'MLT', 'MTQ', 'MRT', 'MUS', 'MYT', 'OWID_MNS',
       'MEX', 'FSM', 'MDA', 'MNG', 'MNE', 'MAR', 'MOZ', 'MMR', 'NAM',
       'NPL', 'NLD', 'NCL', 'NZL', 'NIC', 'NER', 'NGA', 'PRK', 'NOR',
       'OMN', 'PAK', 'PSE', 'PAN', 'PNG', 'PRY', 'PER', 'PHL', 'POL',
       'OWID_PYA', 'PRT', 'PRI', 'QAT', 'REU', 'ROU', 'RUS', 'RWA', 'LCA',
       'VCT', 'WSM', 'STP', 'SAU', 'SEN', 'SRB', 'SYC', 'SLE', 'SGP',
       'SVK', 'SVN', 'SLB', 'SOM', 'ZAF', 'KOR', 'SSD', 'ESP', 'LKA',
       'SDN', 'SUR', 'SWZ', 'SWE', 'CHE', 'SYR', 'TWN', 'TJK', 'TZA',
       'THA', 'TLS', 'TGO', 'TON', 'TTO', 'TUN', 'TUR', 'TKM', 'UGA',
       'UKR', 'ARE', 'GBR', 'USA', 'VIR', 'URY', 'UZB', 'VUT', 'VEN',
       'VNM', 'ESH', 'OWID_WRL', 'YEM', 'ZMB', 'ZWE'], dtype=object)

In [21]:
median_age_2020 = median_age_2020[median_age_2020['Code'] != 'OWID_WRL']
median_age_2020 = median_age_2020[median_age_2020['Code'] != 'OWID_MNS']
median_age_2020 = median_age_2020[median_age_2020['Code'] != 'OWID_PYA']
median_age_2020 = median_age_2020[median_age_2020['Code'] != 'OWID_CIS']

In [22]:
median_age_2020.Code.unique()

array(['AFG', nan, 'ALB', 'DZA', 'AGO', 'ATG', 'ARG', 'ARM', 'ABW', 'AUS',
       'AUT', 'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR', 'BEL', 'BLZ',
       'BEN', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA', 'BRN', 'BGR', 'BFA',
       'BDI', 'KHM', 'CMR', 'CAN', 'CPV', 'CAF', 'TCD', 'CHL', 'CHN',
       'COL', 'COM', 'COG', 'CRI', 'CIV', 'HRV', 'CUB', 'CUW', 'CYP',
       'CZE', 'COD', 'DNK', 'DJI', 'DOM', 'ECU', 'EGY', 'SLV', 'GNQ',
       'ERI', 'EST', 'ETH', 'FJI', 'FIN', 'FRA', 'GUF', 'PYF', 'GAB',
       'GMB', 'GEO', 'DEU', 'GHA', 'GRC', 'GRD', 'GLP', 'GUM', 'GTM',
       'GIN', 'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'HUN', 'ISL', 'IND',
       'IDN', 'IRN', 'IRQ', 'IRL', 'ISR', 'ITA', 'JAM', 'JPN', 'JOR',
       'KAZ', 'KEN', 'KIR', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN', 'LSO',
       'LBR', 'LBY', 'LTU', 'LUX', 'MAC', 'MKD', 'MDG', 'MWI', 'MYS',
       'MDV', 'MLI', 'MLT', 'MTQ', 'MRT', 'MUS', 'MYT', 'MEX', 'FSM',
       'MDA', 'MNG', 'MNE', 'MAR', 'MOZ', 'MMR', 'NAM', 'NPL', 'NLD',
       'NCL', 'NZL', 'NIC', 'NER', 'NGA', 'PRK', 'NOR', 'OMN', 'PAK',
       'PSE', 'PAN', 'PNG', 'PRY', 'PER', 'PHL', 'POL', 'PRT', 'PRI',
       'QAT', 'REU', 'ROU', 'RUS', 'RWA', 'LCA', 'VCT', 'WSM', 'STP',
       'SAU', 'SEN', 'SRB', 'SYC', 'SLE', 'SGP', 'SVK', 'SVN', 'SLB',
       'SOM', 'ZAF', 'KOR', 'SSD', 'ESP', 'LKA', 'SDN', 'SUR', 'SWZ',
       'SWE', 'CHE', 'SYR', 'TWN', 'TJK', 'TZA', 'THA', 'TLS', 'TGO',
       'TON', 'TTO', 'TUN', 'TUR', 'TKM', 'UGA', 'UKR', 'ARE', 'GBR',
       'USA', 'VIR', 'URY', 'UZB', 'VUT', 'VEN', 'VNM', 'ESH', 'YEM',
       'ZMB', 'ZWE'], dtype=object)

### remove rows that contain NaN

In [23]:
bool_crit_2 = (pd.isnull(median_age_2020.Code))
print('Number of NaN entries identified:', sum(bool_crit_2))
median_age_2020[bool_crit_2]

Number of NaN entries identified: 37

                                                 Entity Code  Year  median age
45                                               Africa  NaN  2020   19.799999
293                                                Asia  NaN  2020   32.099998
355                               Australia/New Zealand  NaN  2020   37.900002
1099                                          Caribbean  NaN  2020   31.900000
1161                                    Central America  NaN  2020   28.299999
1192                                       Central Asia  NaN  2020   27.900000
1781                                     Eastern Africa  NaN  2020   18.700001
1812                                       Eastern Asia  NaN  2020   39.599998
1843                                     Eastern Europe  NaN  2020   40.799999
2091                                             Europe  NaN  2020   42.700001
2711                                        High income  NaN  2020   41.500000
3362                          Latin America & Caribbean  NaN  2020   30.900000
3424                          Least developed countries  NaN  2020   20.400000
3517                             Less developed regions  NaN  2020   29.100000
3548            Less developed regions, excluding China  NaN  2020   26.299999
3579  Less developed regions, excluding least develo...  NaN  2020   30.900000
3703                                         Low income  NaN  2020   18.900000
3734                                Lower middle income  NaN  2020   26.400000
4261                                Micronesia (region)  NaN  2020   26.900000
4292                                      Middle Africa  NaN  2020   17.400000
4323                                      Middle income  NaN  2020   30.700001
4447                             More developed regions  NaN  2020   42.099998
4850                                    Northern Africa  NaN  2020   25.900000
4881                                   Northern America  NaN  2020   38.599998
4912                                    Northern Europe  NaN  2020   41.000000
4974                                            Oceania  NaN  2020   33.500000
5997                                      South America  NaN  2020   32.000000
6090                                 South-Central Asia  NaN  2020   27.600000
6121                                 South-Eastern Asia  NaN  2020   30.000000
6152                                    Southern Africa  NaN  2020   26.700001
6183                                      Southern Asia  NaN  2020   27.600000
6214                                    Southern Europe  NaN  2020   45.900002
6307                                 Sub-Saharan Africa  NaN  2020   18.700001
7051                                Upper middle income  NaN  2020   35.599998
7237                                     Western Africa  NaN  2020   18.200001
7268                                       Western Asia  NaN  2020   27.799999
7299                                     Western Europe  NaN  2020   44.200001

### select and rename columns

In [146]:
median_age_2020_countries = median_age_2020[~bool_crit_2]
median_age_2020_countries = median_age_2020_countries[['Entity','median age']]
median_age_2020_countries.rename(columns={ 'Entity':'Country Name','median age':'median age_2020'},inplace=True)
median_age_2020_countries

             Country Name  median age_2020
14            Afghanistan        18.600000
76                Albania        38.000000
107               Algeria        29.100000
138                Angola        16.799999
169   Antigua and Barbuda        32.099998
...                   ...              ...
7206              Vietnam        32.599998
7330       Western Sahara        28.400000
7392                Yemen        20.299999
7423               Zambia        17.700001
7454             Zimbabwe        19.600000

[200 rows x 2 columns]

### Age Structure/breakdown by countries

In [147]:
age_breakdown = pd.read_csv('population-by-broad-age-group.csv')
age_breakdown.head()

,Entity,Code,Year,Under-5s,15-24 years,25-64 years,65+ years,5-14 years
0,Afghanistan,AFG,1950,1291622.0,1476233.0,2873065.0,222954.0,1888244.0
1,Afghanistan,AFG,1951,1314241.0,1488524.0,2887631.0,228191.0,1920923.0
2,Afghanistan,AFG,1952,1318908.0,1507272.0,2914594.0,232456.0,1961750.0
3,Afghanistan,AFG,1953,1321524.0,1529407.0,2947925.0,235252.0,2004488.0
4,Afghanistan,AFG,1954,1331640.0,1553939.0,2984840.0,236391.0,2043637.0

In [148]:
age_breakdown.Year.unique()

array([1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960,
       1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982,
       1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993,
       1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004,
       2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015])

In [149]:
#select rows that year = 2015
age_breakdown_2015 = age_breakdown[age_breakdown['Year'] == 2015]
age_breakdown_2015.head()

,Entity,Code,Year,Under-5s,15-24 years,25-64 years,65+ years,5-14 years
65,Afghanistan,AFG,2015,5239401.0,7062361.0,10809505.0,841098.0,9784129.0
131,Africa,NaN,2015,186990405.0,230510571.0,432321087.0,41273702.0,303274143.0
197,Albania,ALB,2015,171783.0,475257.0,1554614.0,366492.0,355206.0
263,Algeria,DZA,2015,4663613.0,6614548.0,19492212.0,2340373.0,6760782.0
329,Angola,AGO,2015,5158374.0,5329040.0,8771497.0,642523.0,7957871.0

In [150]:
age_breakdown_2015.Code.unique()

array(['AFG', nan, 'ALB', 'DZA', 'AGO', 'ATG', 'ARG', 'ARM', 'ABW', 'AUS',
       'AUT', 'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR', 'BEL', 'BLZ',
       'BEN', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA', 'BRN', 'BGR', 'BFA',
       'BDI', 'KHM', 'CMR', 'CAN', 'CPV', 'CAF', 'TCD', 'OWID_CIS', 'CHL',
       'CHN', 'COL', 'COM', 'COG', 'CRI', 'CIV', 'HRV', 'CUB', 'CUW',
       'CYP', 'CZE', 'COD', 'DNK', 'DJI', 'DOM', 'ECU', 'EGY', 'SLV',
       'GNQ', 'ERI', 'EST', 'ETH', 'FJI', 'FIN', 'FRA', 'GUF', 'PYF',
       'GAB', 'GMB', 'GEO', 'DEU', 'GHA', 'GRC', 'GRD', 'GUM', 'GTM',
       'GIN', 'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'HUN', 'ISL', 'IND',
       'IDN', 'IRN', 'IRQ', 'IRL', 'ISR', 'ITA', 'JAM', 'JPN', 'JOR',
       'KAZ', 'KEN', 'KIR', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN', 'LSO',
       'LBR', 'LBY', 'LTU', 'LUX', 'MAC', 'MKD', 'MDG', 'MWI', 'MYS',
       'MDV', 'MLI', 'MLT', 'MTQ', 'MRT', 'MUS', 'MYT', 'OWID_MNS', 'MEX',
       'FSM', 'MDA', 'MNG', 'MNE', 'MAR', 'MOZ', 'MMR', 'NAM', 'NPL',
       'NLD', 'NCL', 'NZL', 'NIC', 'NER', 'NGA', 'PRK', 'NOR', 'OMN',
       'PAK', 'PSE', 'PAN', 'PNG', 'PRY', 'PER', 'PHL', 'POL', 'OWID_PYA',
       'PRT', 'PRI', 'QAT', 'REU', 'ROU', 'RUS', 'RWA', 'LCA', 'VCT',
       'WSM', 'STP', 'SAU', 'SEN', 'SYC', 'SLE', 'SGP', 'SVK', 'SVN',
       'SLB', 'SOM', 'ZAF', 'KOR', 'SSD', 'ESP', 'LKA', 'SDN', 'SUR',
       'SWZ', 'SWE', 'CHE', 'SYR', 'TWN', 'TJK', 'TZA', 'THA', 'TLS',
       'TGO', 'TON', 'TTO', 'TUN', 'TUR', 'TKM', 'UGA', 'UKR', 'ARE',
       'GBR', 'USA', 'VIR', 'URY', 'UZB', 'VUT', 'VEN', 'VNM', 'ESH',
       'OWID_WRL', 'YEM', 'ZMB', 'ZWE'], dtype=object)

In [151]:
age_breakdown_2015 = age_breakdown_2015[age_breakdown_2015['Code'] != 'OWID_WRL']
age_breakdown_2015 = age_breakdown_2015[age_breakdown_2015['Code'] != 'OWID_MNS']
age_breakdown_2015 = age_breakdown_2015[age_breakdown_2015['Code'] != 'OWID_PYA']
age_breakdown_2015 = age_breakdown_2015[age_breakdown_2015['Code'] != 'OWID_CIS']
age_breakdown_2015.Code.unique()

array(['AFG', nan, 'ALB', 'DZA', 'AGO', 'ATG', 'ARG', 'ARM', 'ABW', 'AUS',
       'AUT', 'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR', 'BEL', 'BLZ',
       'BEN', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA', 'BRN', 'BGR', 'BFA',
       'BDI', 'KHM', 'CMR', 'CAN', 'CPV', 'CAF', 'TCD', 'CHL', 'CHN',
       'COL', 'COM', 'COG', 'CRI', 'CIV', 'HRV', 'CUB', 'CUW', 'CYP',
       'CZE', 'COD', 'DNK', 'DJI', 'DOM', 'ECU', 'EGY', 'SLV', 'GNQ',
       'ERI', 'EST', 'ETH', 'FJI', 'FIN', 'FRA', 'GUF', 'PYF', 'GAB',
       'GMB', 'GEO', 'DEU', 'GHA', 'GRC', 'GRD', 'GUM', 'GTM', 'GIN',
       'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'HUN', 'ISL', 'IND', 'IDN',
       'IRN', 'IRQ', 'IRL', 'ISR', 'ITA', 'JAM', 'JPN', 'JOR', 'KAZ',
       'KEN', 'KIR', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN', 'LSO', 'LBR',
       'LBY', 'LTU', 'LUX', 'MAC', 'MKD', 'MDG', 'MWI', 'MYS', 'MDV',
       'MLI', 'MLT', 'MTQ', 'MRT', 'MUS', 'MYT', 'MEX', 'FSM', 'MDA',
       'MNG', 'MNE', 'MAR', 'MOZ', 'MMR', 'NAM', 'NPL', 'NLD', 'NCL',
       'NZL', 'NIC', 'NER', 'NGA', 'PRK', 'NOR', 'OMN', 'PAK', 'PSE',
       'PAN', 'PNG', 'PRY', 'PER', 'PHL', 'POL', 'PRT', 'PRI', 'QAT',
       'REU', 'ROU', 'RUS', 'RWA', 'LCA', 'VCT', 'WSM', 'STP', 'SAU',
       'SEN', 'SYC', 'SLE', 'SGP', 'SVK', 'SVN', 'SLB', 'SOM', 'ZAF',
       'KOR', 'SSD', 'ESP', 'LKA', 'SDN', 'SUR', 'SWZ', 'SWE', 'CHE',
       'SYR', 'TWN', 'TJK', 'TZA', 'THA', 'TLS', 'TGO', 'TON', 'TTO',
       'TUN', 'TUR', 'TKM', 'UGA', 'UKR', 'ARE', 'GBR', 'USA', 'VIR',
       'URY', 'UZB', 'VUT', 'VEN', 'VNM', 'ESH', 'YEM', 'ZMB', 'ZWE'],
      dtype=object)

### remove rows that contain NaN

In [152]:
bool_crit_3 = (pd.isnull(age_breakdown_2015.Code))
print('Number of NaN entries identified:', sum(bool_crit_3))
age_breakdown_2015[bool_crit_3]

Number of NaN entries identified: 39

,Entity,Code,Year,Under-5s,15-24 years,25-64 years,65+ years,5-14 years
131,Africa,NaN,2015,186990405.0,2.305106e+08,4.323211e+08,41273702.0,3.032741e+08
659,Asia,NaN,2015,368116983.0,7.171024e+08,2.282897e+09,334742675.0,7.170385e+08
791,Australia/New Zealand,NaN,2015,1853797.0,3.802218e+06,1.496724e+07,4240364.0,3.550474e+06
2375,Caribbean,NaN,2015,3611501.0,7.199968e+06,2.122923e+07,4054027.0,7.214886e+06
2507,Central America,NaN,2015,16443025.0,3.242048e+07,8.003654e+07,10839384.0,3.289568e+07
2573,Central Asia,NaN,2015,7779756.0,1.245906e+07,3.301102e+07,3271278.0,1.218389e+07
3827,Eastern Africa,NaN,2015,64685579.0,8.143128e+07,1.327245e+08,12021351.0,1.085953e+08
3893,Eastern Asia,NaN,2015,96913267.0,2.094462e+08,9.630396e+08,181628477.0,1.841229e+08
3959,Eastern Europe,NaN,2015,17057763.0,3.206172e+07,1.710074e+08,43445311.0,2.967149e+07
4487,Europe,NaN,2015,40069690.0,8.167600e+07,4.119832e+08,130378427.0,7.670667e+07
5345,Guadeloupe (including Saint-Barthélemy and Sai...,NaN,2015,26573.0,6.384900e+04,2.252320e+05,73818.0,6.094600e+04
5807,High-income countries,NaN,2015,65104559.0,1.435888e+08,6.381329e+08,200805187.0,1.324295e+08
7193,Latin America and the Caribbean,NaN,2015,53446008.0,1.104220e+08,3.120415e+08,48129380.0,1.083419e+08
7325,Least developed countries,NaN,2015,140770364.0,1.903331e+08,3.483569e+08,33909416.0,2.432614e+08
7523,Less developed regions,NaN,2015,604529175.0,1.048032e+09,2.965953e+09,391325067.0,1.119963e+09
7589,"Less developed regions, excluding China",NaN,2015,517312563.0,8.619068e+08,2.114121e+09,252112981.0,9.559884e+08
7655,"Less developed regions, excluding least develo...",NaN,2015,463758811.0,8.576994e+08,2.617596e+09,357415651.0,8.767012e+08
7919,Low-income countries,NaN,2015,103397438.0,1.278182e+08,2.172150e+08,21460052.0,1.719678e+08
7985,Lower-middle-income countries,NaN,2015,319751960.0,5.495526e+08,1.341957e+09,154743263.0,6.038964e+08
9107,Micronesia (region),NaN,2015,51374.0,9.840300e+04,2.338410e+05,31065.0,1.043120e+05
9173,Middle Africa,NaN,2015,27615846.0,2.952190e+07,4.950654e+07,4470465.0,4.262798e+07
9239,Middle-income countries,NaN,2015,504903895.0,9.226688e+08,2.789335e+09,389355174.0,9.520010e+08
9503,More developed regions,NaN,2015,69120505.0,1.464731e+08,6.801207e+08,220572099.0,1.369201e+08
10361,Northern Africa,NaN,2015,28062047.0,3.970254e+07,1.008778e+08,11790981.0,4.470231e+07
10427,Northern America,NaN,2015,21801481.0,4.887616e+07,1.872328e+08,52660156.0,4.543298e+07
10493,Northern Europe,NaN,2015,6248821.0,1.256114e+07,5.377231e+07,18706363.0,1.180866e+07
10625,Oceania,NaN,2015,3225113.0,5.918472e+06,1.959812e+07,4712826.0,6.088450e+06
12209,Serbia (including Kosovo),NaN,2015,467960.0,1.116403e+06,4.816361e+06,1443226.0,1.007330e+06
12803,South America,NaN,2015,33391482.0,7.080156e+07,2.107757e+08,33235969.0,6.823137e+07
13001,South-Central Asia,NaN,2015,185857044.0,3.519772e+08,8.806143e+08,102053947.0,3.715110e+08
13067,South-Eastern Asia,NaN,2015,57783744.0,1.107002e+08,3.167512e+08,37561638.0,1.118130e+08
13133,Southern Africa,NaN,2015,6712733.0,1.202680e+07,2.918146e+07,3113769.0,1.238488e+07
13199,Southern Asia,NaN,2015,178077288.0,3.395182e+08,8.476033e+08,98782669.0,3.593271e+08
13265,Southern Europe,NaN,2015,6966403.0,1.543668e+07,8.437010e+07,30453432.0,1.521404e+07
13463,Sub-Saharan Africa,NaN,2015,158928358.0,1.908080e+08,3.314433e+08,29482721.0,2.585718e+08
15047,Upper-middle-income countries,NaN,2015,185151935.0,3.731162e+08,1.447378e+09,234611911.0,3.481046e+08
15443,Western Africa,NaN,2015,59914200.0,6.782806e+07,1.200308e+08,9877136.0,9.496371e+07
15509,Western Asia,NaN,2015,27562928.0,4.497868e+07,1.224920e+08,13498613.0,4.959167e+07
15575,Western Europe,NaN,2015,9796703.0,2.161646e+07,1.028333e+08,37773321.0,2.001248e+07

In [153]:
age_breakdown_2015_countries = age_breakdown_2015[~bool_crit_3]

In [154]:
age_breakdown_2015_countries.Code.unique()

array(['AFG', 'ALB', 'DZA', 'AGO', 'ATG', 'ARG', 'ARM', 'ABW', 'AUS',
       'AUT', 'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR', 'BEL', 'BLZ',
       'BEN', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA', 'BRN', 'BGR', 'BFA',
       'BDI', 'KHM', 'CMR', 'CAN', 'CPV', 'CAF', 'TCD', 'CHL', 'CHN',
       'COL', 'COM', 'COG', 'CRI', 'CIV', 'HRV', 'CUB', 'CUW', 'CYP',
       'CZE', 'COD', 'DNK', 'DJI', 'DOM', 'ECU', 'EGY', 'SLV', 'GNQ',
       'ERI', 'EST', 'ETH', 'FJI', 'FIN', 'FRA', 'GUF', 'PYF', 'GAB',
       'GMB', 'GEO', 'DEU', 'GHA', 'GRC', 'GRD', 'GUM', 'GTM', 'GIN',
       'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'HUN', 'ISL', 'IND', 'IDN',
       'IRN', 'IRQ', 'IRL', 'ISR', 'ITA', 'JAM', 'JPN', 'JOR', 'KAZ',
       'KEN', 'KIR', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN', 'LSO', 'LBR',
       'LBY', 'LTU', 'LUX', 'MAC', 'MKD', 'MDG', 'MWI', 'MYS', 'MDV',
       'MLI', 'MLT', 'MTQ', 'MRT', 'MUS', 'MYT', 'MEX', 'FSM', 'MDA',
       'MNG', 'MNE', 'MAR', 'MOZ', 'MMR', 'NAM', 'NPL', 'NLD', 'NCL',
       'NZL', 'NIC', 'NER', 'NGA', 'PRK', 'NOR', 'OMN', 'PAK', 'PSE',
       'PAN', 'PNG', 'PRY', 'PER', 'PHL', 'POL', 'PRT', 'PRI', 'QAT',
       'REU', 'ROU', 'RUS', 'RWA', 'LCA', 'VCT', 'WSM', 'STP', 'SAU',
       'SEN', 'SYC', 'SLE', 'SGP', 'SVK', 'SVN', 'SLB', 'SOM', 'ZAF',
       'KOR', 'SSD', 'ESP', 'LKA', 'SDN', 'SUR', 'SWZ', 'SWE', 'CHE',
       'SYR', 'TWN', 'TJK', 'TZA', 'THA', 'TLS', 'TGO', 'TON', 'TTO',
       'TUN', 'TUR', 'TKM', 'UGA', 'UKR', 'ARE', 'GBR', 'USA', 'VIR',
       'URY', 'UZB', 'VUT', 'VEN', 'VNM', 'ESH', 'YEM', 'ZMB', 'ZWE'],
      dtype=object)

In [155]:
age_breakdown_2015_countries.head()

,Entity,Code,Year,Under-5s,15-24 years,25-64 years,65+ years,5-14 years
65,Afghanistan,AFG,2015,5239401.0,7062361.0,10809505.0,841098.0,9784129.0
197,Albania,ALB,2015,171783.0,475257.0,1554614.0,366492.0,355206.0
263,Algeria,DZA,2015,4663613.0,6614548.0,19492212.0,2340373.0,6760782.0
329,Angola,AGO,2015,5158374.0,5329040.0,8771497.0,642523.0,7957871.0
395,Antigua and Barbuda,ATG,2015,8036.0,16895.0,51910.0,6578.0,16504.0

### Reorder columns

In [156]:
age_breakdown_2015_countries = age_breakdown_2015_countries[['Entity','Under-5s','5-14 years','15-24 years','25-64 years','65+ years']]

### remane columns names

In [157]:
age_breakdown_2015_countries = age_breakdown_2015_countries.rename(columns={'Entity':'Country Name','Under-5s':'Under-5s_2015','5-14 years':'5-14 years_2015', '15-24 years':'15-24 years_2015','25-64 years':'25-64 years_2015','65+ years':'65+ years_2015'})
age_breakdown_2015_countries.head()

,Country Name,Under-5s_2015,5-14 years_2015,15-24 years_2015,25-64 years_2015,65+ years_2015
65,Afghanistan,5239401.0,9784129.0,7062361.0,10809505.0,841098.0
197,Albania,171783.0,355206.0,475257.0,1554614.0,366492.0
263,Algeria,4663613.0,6760782.0,6614548.0,19492212.0,2340373.0
329,Angola,5158374.0,7957871.0,5329040.0,8771497.0,642523.0
395,Antigua and Barbuda,8036.0,16504.0,16895.0,51910.0,6578.0

In [158]:
age_data = age_breakdown_2015_countries.merge(median_age_2020_countries, how = 'inner', on = ['Country Name'])

In [159]:
age_data.head()

,Country Name,Under-5s_2015,5-14 years_2015,15-24 years_2015,25-64 years_2015,65+ years_2015,median age_2020
0,Afghanistan,5239401.0,9784129.0,7062361.0,10809505.0,841098.0,18.600000
1,Albania,171783.0,355206.0,475257.0,1554614.0,366492.0,38.000000
2,Algeria,4663613.0,6760782.0,6614548.0,19492212.0,2340373.0,29.100000
3,Angola,5158374.0,7957871.0,5329040.0,8771497.0,642523.0,16.799999
4,Antigua and Barbuda,8036.0,16504.0,16895.0,51910.0,6578.0,32.099998

## Economic Indicators - all countries

### GDP per capita, PPP

In [133]:
GDP = pd.read_csv('API_NY.GDP.PCAP.PP.CD_DS2_en_csv_v2_988619.csv', skiprows = 1, header = 1)
GDP.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,"GDP per capita, PPP (current international $)",NY.GDP.PCAP.PP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,35492.618487,35498.982089,37419.892817,38223.372261,38249.054868,38390.271649,39454.629831,NaN,NaN,NaN
1,Afghanistan,AFG,"GDP per capita, PPP (current international $)",NY.GDP.PCAP.PP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1626.764793,1806.763930,1874.765634,1897.525938,1886.692977,1896.992520,1934.636754,1955.006208,NaN,NaN
2,Angola,AGO,"GDP per capita, PPP (current international $)",NY.GDP.PCAP.PP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,6346.395122,6772.528333,6980.423038,7199.245478,7096.600615,6756.935074,6650.584940,6452.355165,NaN,NaN
3,Albania,ALB,"GDP per capita, PPP (current international $)",NY.GDP.PCAP.PP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,10207.752347,10526.235446,10571.010650,11259.225894,11662.030481,11868.178968,12930.140035,13364.155397,NaN,NaN
4,Andorra,AND,"GDP per capita, PPP (current international $)",NY.GDP.PCAP.PP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [134]:
GDP_2018 = GDP[['Country Name','2018']]
GDP_2018.head()

  Country Name          2018
0        Aruba           NaN
1  Afghanistan   1955.006208
2       Angola   6452.355165
3      Albania  13364.155397
4      Andorra           NaN

### Remove NaN rows

In [135]:
bool_crit_4 = (pd.isnull(GDP_2018['2018']))
print('Number of NaN entries identified:', sum(bool_crit_4))
GDP_2018[bool_crit_4]

Number of NaN entries identified: 33

                                          Country Name  2018
0                                                Aruba   NaN
4                                              Andorra   NaN
9                                       American Samoa   NaN
25                                             Bermuda   NaN
36                                     Channel Islands   NaN
48                                                Cuba   NaN
50                                      Cayman Islands   NaN
54                                            Djibouti   NaN
67                                             Eritrea   NaN
76                                       Faroe Islands   NaN
82                                           Gibraltar   NaN
89                                           Greenland   NaN
91                                                Guam   NaN
106                                        Isle of Man   NaN
108                                     Not classified   NaN
110                                 Iran, Islamic Rep.   NaN
135                                      Liechtenstein   NaN
145                           St. Martin (French part)   NaN
147                                             Monaco   NaN
159  Middle East & North Africa (excluding high inc...   NaN
162                           Northern Mariana Islands   NaN
170                                      New Caledonia   NaN
191                          Korea, Dem. People’s Rep.   NaN
197                                   French Polynesia   NaN
210                                         San Marino   NaN
211                                            Somalia   NaN
214                                        South Sudan   NaN
223                          Sint Maarten (Dutch part)   NaN
225                               Syrian Arab Republic   NaN
236  Middle East & North Africa (IDA & IBRD countries)   NaN
252                                      Venezuela, RB   NaN
253                             British Virgin Islands   NaN
254                              Virgin Islands (U.S.)   NaN

In [137]:
GDP_2018_countries = GDP_2018[~bool_crit_4]
GDP_2018_countries.rename(columns={'2018':'GDP_2018'},inplace=True)
GDP_2018_countries.head()

           Country Name      GDP_2018
1           Afghanistan   1955.006208
2                Angola   6452.355165
3               Albania  13364.155397
5            Arab World  17570.137596
6  United Arab Emirates  75075.257411

### Unemployment rate

In [138]:
unemployment = pd.read_csv('unemployment.csv',skiprows = 1, header = 1 )
unemployment.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,11.488,11.508,11.534,11.448,11.387,11.313,11.184,11.057,11.118,NaN
2,Angola,AGO,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,7.362,7.379,7.400,7.331,7.282,7.223,7.119,7.019,6.886,NaN
3,Albania,ALB,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,13.481,13.376,15.866,17.490,17.080,15.220,13.750,12.340,12.331,NaN
4,Andorra,AND,"Unemployment, total (% of total labor force) (...",SL.UEM.TOTL.ZS,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
unemployment_rate = unemployment[['Country Name', 'Country Code','2019']] 
unemployment_rate.head()

  Country Name Country Code    2019
0        Aruba          ABW     NaN
1  Afghanistan          AFG  11.118
2       Angola          AGO   6.886
3      Albania          ALB  12.331
4      Andorra          AND     NaN

#### Remove NaN columns

In [139]:
bool_crit_5 = (pd.isnull(unemployment_rate['2019']))
print('Number of NaN entries identified:', sum(bool_crit_5))
unemployment_rate[bool_crit_5].head()

Number of NaN entries identified: 31

           Country Name Country Code  2019
0                 Aruba          ABW   NaN
4               Andorra          AND   NaN
9        American Samoa          ASM   NaN
10  Antigua and Barbuda          ATG   NaN
25              Bermuda          BMU   NaN

In [140]:
unemployment_rate_2019_countries = unemployment_rate[~bool_crit_5]
unemployment_rate_2019_countries.head()

           Country Name Country Code       2019
1           Afghanistan          AFG  11.118000
2                Angola          AGO   6.886000
3               Albania          ALB  12.331000
5            Arab World          ARB  10.337095
6  United Arab Emirates          ARE   2.348000

#### Select and Rename columns

In [144]:
unemployment_rate_2019_countries = unemployment_rate_2019_countries[['Country Name','2019']]
unemployment_rate_2019_countries.rename(columns={'2019':'umemployment rate_2019'},inplace=True)
unemployment_rate_2019_countries.head()

           Country Name  umemployment rate_2019
1           Afghanistan               11.118000
2                Angola                6.886000
3               Albania               12.331000
5            Arab World               10.337095
6  United Arab Emirates                2.348000

#### Combine dataframes

In [161]:
df = age_data.merge(unemployment_rate_2019_countries, how = 'inner', on = ['Country Name'])
df_new = df.merge(GDP_2018_countries, how='inner', on = ['Country Name'])
df_new.head()

,Country Name,Under-5s_2015,5-14 years_2015,15-24 years_2015,25-64 years_2015,65+ years_2015,median age_2020,umemployment rate_2019,GDP_2018
0,Afghanistan,5239401.0,9784129.0,7062361.0,10809505.0,841098.0,18.600000,11.118,1955.006208
1,Albania,171783.0,355206.0,475257.0,1554614.0,366492.0,38.000000,12.331,13364.155397
2,Algeria,4663613.0,6760782.0,6614548.0,19492212.0,2340373.0,29.100000,11.704,15481.787620
3,Angola,5158374.0,7957871.0,5329040.0,8771497.0,642523.0,16.799999,6.886,6452.355165
4,Argentina,3718139.0,7221374.0,6894781.0,20839515.0,4743956.0,31.900000,9.789,20610.568550

## Health System Indicators

In [46]:
def only2017(data):
    data=data[['Country Name','2017']]
    nanrow=pd.isnull(data['2017'])
    return data[~nanrow]

def only2015(data):
    data=data[['Country Name','2015']]
    nanrow=pd.isnull(data['2015'])
    return data[~nanrow]

### Hospital beds

In [47]:
#hospitalbeds=pd.read_csv('hospitalbeds.csv')
#hospitalbeds_2017=only2017(hospitalbeds)
#hospitalbeds_2017.head()

In [48]:
hospitalbed2=pd.read_csv('hospitalbed2.csv',skiprows = 1, header = 1)
hospitalbed2=only2015(hospitalbed2)
hospitalbed2.head()

         Country Name  2015
1         Afghanistan   0.5
8             Armenia   4.2
18         Bangladesh   0.8
29  Brunei Darussalam   2.7
46         Costa Rica   1.2

### Health expenditure per capita

In [49]:
health_expenditure_percap=pd.read_csv('health_exp_cap.csv',skiprows = 1, header = 1)
health_expenditure_percap_2017=only2017(health_expenditure_percap)
health_expenditure_percap_2017.head()

           Country Name         2017
1           Afghanistan    67.122650
2                Angola   114.459641
4               Andorra  4040.786621
6  United Arab Emirates  1357.017456
7             Argentina  1324.603516

### Health expenditure out of pocket per capita

In [50]:
out_pocket=pd.read_csv('outofpocket.csv',skiprows = 1, header = 1)
out_pocket=only2017(out_pocket)
out_pocket.head()

           Country Name       2017
1           Afghanistan  75.482577
2                Angola  34.121013
4               Andorra  41.777053
6  United Arab Emirates  18.867441
7             Argentina  15.018527

### Physicians per 1000 people

In [51]:
physicians= pd.read_csv('physicians.csv',skiprows = 1, header = 1)
physicians_2017=only2017(physicians)
physicians_2017.head()

           Country Name    2017
2                Angola  0.2149
7             Argentina  3.9600
10  Antigua and Barbuda  2.7647
18           Bangladesh  0.5268
21         Bahamas, The  1.9373

### People with basic handwashing facilities including soap and water (% of population)

In [52]:
handsoap=pd.read_csv('handsoap%.csv',skiprows = 1, header = 1)
handsoap_2017=only2017(handsoap)
handsoap_2017.head()

   Country Name       2017
1   Afghanistan  37.746032
2        Angola  26.664183
5    Arab World  70.171735
8       Armenia  94.042941
13   Azerbaijan  83.241300

### above 65 population %

In [53]:
above65=pd.read_csv('above65.csv',skiprows = 1, header = 1)
above65_2017=only2017(above65)
above65_2017.head()

  Country Name       2017
0        Aruba  13.073477
1  Afghanistan   2.554251
2       Angola   2.239197
3      Albania  13.329073
5   Arab World   4.461560

In [54]:
#keys=health_expenditure_percap['Country Name']
#define 
  #for i in keys:
       #data.loc[i]=